app/Repositories/BaseRepository.php

    public function findObjectByCategoryIds($catIds, $model, $language){
        $query = $this->model->newQuery();
        $this->model->select(
                $model.'s.*',
            )
            ->where(
                [config('apps.general.defaultPublish')]
            )
            ->with('languages', function($query) use ($language){
                $query->where('language_id', $language);
            })
            ->with($model.'_catalogues', function($query) use ($language){
                $query->with('languages', function($query) use ($language){
                    $query->where('language_id', $language);
                });
            });

            if($model === 'product'){
                $query->with('product_variants');
            }

            $query->join($model.'_catalogue_'.$model.' as tb2', 'tb2.'.$model.'_id', '=', $model.'s.id')
            ->whereIn('tb2.'.$model.'_catalogue_id', $catIds)
            ->orderBy($model.'s.'.$model.'_catalogue_id', 'desc')
            ->limit(10)
            ->get();

            return $query->get();
---
select * from `product_variants` where `product_variants`.`product_id` in (39, 40, 41, 42, 43, 44, 45, 46, 47, 48)